app/views/ratings/new.html.erb

<%= form_for(@rating) do |f| %>
  <%= f.select :beer_id, options_from_collection_for_select(@beers, :id, :to_s, selected: @rating.beer_id) %>
---
SELECT "beers".* FROM "beers"