app/views/styles/show.html.erb

<ul>
  <% @style.beers.each do |beer| %>
---
SELECT "beers".* FROM "beers" WHERE "beers"."style_id" = ?  [["style_id", 1]]