app/controllers/breweries_controller.rb

  def create
    @brewery = Brewery.new(brewery_params)

    respond_to do |format|
      if @brewery.save
---
INSERT INTO "breweries" ("name", "year", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Teerenpeli"], ["year", 1900], ["created_at", "2016-02-26 19:10:08.124731"], ["updated_at", "2016-02-26 19:10:08.124731"]]