app/controllers/ratings_controller.rb

INSERT INTO "ratings" ("score", "beer_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["score", 20], ["beer_id", 1], ["created_at", "2016-02-26 20:18:07.122153"], ["updated_at", "2016-02-26 20:18:07.122153"]]
---
  def create
    @rating = Rating.new params.require(:rating).permit(:score, :beer_id)

    if @rating.save