app/controllers/styles_controller.rb

  def index
    @styles = Style.all
---
SELECT "styles".* FROM "styles"

  def create
    @style = Style.new(style_params)

    respond_to do |format|
      if @style.save
---
INSERT INTO "styles" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Lager"], ["description", "Tämä on lager."], ["created_at", "2016-02-26 20:14:18.198915"], ["updated_at", "2016-02-26 20:14:18.198915"]]

    def set_style
      @style = Style.find(params[:id])
---
SELECT  "styles".* FROM "styles" WHERE "styles"."id" = ? LIMIT 1  [["id", 1]]