app/controllers/users_controller.rb

  def index
    @users = User.includes(:beers).all
---
SELECT "users".* FROM "users"

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("username", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?)